from telegram import *
from telegram.ext import *
token = "1883219687:AAFnZqXp0rtwfytsAk6FWWSFOG_ZdKE_30g"
bot = Bot(token)
updater = Updater(token, use_context=True)
dispatcher: Dispatcher = updater.dispatcher

keyboard_1 = [
            [InlineKeyboardButton(
             "پیشگیری ودرمان باحدیث پیامیر صل الله علیه وآله",
             callback_data="siroasal")],
            [InlineKeyboardButton(
                "پیشگیری و درمان با حدیث امام کاظم علیه السلام",
             callback_data="daruye_emam")],
            [InlineKeyboardButton("نباید دم کرده استفاده کرد",
             callback_data="damnoosh")],
            [InlineKeyboardButton("جلوگیری از عوارض واکسن کرونا",
             callback_data="vaksan")],
            [InlineKeyboardButton("ارتباط با ما", callback_data="contact_us"),
                InlineKeyboardButton("درباره ی ما", callback_data="about_us")],
            ]
keyboard_2 = [
            [InlineKeyboardButton("حدیث پیامبر صل الله علیه السلام",
             callback_data="asnade_siroasal")],
            [InlineKeyboardButton(" طرز تهیه و ترکیب سیر خام وعسل ",
             callback_data="use_siroasal")],
            [InlineKeyboardButton("روش پیشگیری در حالت عادی",
             callback_data="pishgiri_adi_siroasal")],
            [InlineKeyboardButton("روش پیشگیری برای کادر درمان و پرستاران",
             callback_data="kadr_darman_siroasal")],
            [InlineKeyboardButton("روش درمان کرونا",
             callback_data="darman_corona")],
            [InlineKeyboardButton("نکات مهم و عمومی که باید رعایت شود",
             callback_data="public_warning")],
            [InlineKeyboardButton("درمان سایر بیماری ها",
             callback_data="darman_sayere_bimariha_siroasal")]
            ]
keyboard_3 = [
            [InlineKeyboardButton("حدیث و مستندات ",
             callback_data="asnade_daru")],
            [InlineKeyboardButton("روش تهیه داروی تابستانه",
             callback_data="tabestane")],
            [InlineKeyboardButton("روش تهیه داروی زمستانه",
             callback_data="zemestane")],
            [InlineKeyboardButton("روش پیشگیری در حالت عادی",
             callback_data="mavarede_khas_daru")],
            [InlineKeyboardButton("روش پیشگیری برای کادر درمان و پرستاران",
             callback_data="khozestan")]
            [InlineKeyboardButton("روش درمان بیماران کرونایی",
             callback_data="khozestan")]
            [InlineKeyboardButton("نکات عمومی مهمی که باید رعایت شوند",
             callback_data="khozestan")]
            [InlineKeyboardButton("دستورالعمل عمومی درمان سایر بیماری ها",
             callback_data="khozestan")]
            [InlineKeyboardButton("تجربه انجام شده در خوزستان",
             callback_data="khozestan")]
            [InlineKeyboardButton("تجربیات موفق کاربران",
             callback_data="khozestan")]
            ]
keyboard_4 = [
            [InlineKeyboardButton(" چرا واکسن نزنیم؟",
             callback_data="vaksan_nemizanim")],
            [InlineKeyboardButton('''آیا زدن واکسن توسط رهبری و مراجع تقلید
حجت شرعی است؟''',
             callback_data="vaksan_maraje")],
            [InlineKeyboardButton("عوارض واکسن ها چه هستند",
             callback_data="avareze_vaksan")],
            [InlineKeyboardButton("چگونه از عوارض  سوء واکسن ها پیشگیری کنیم؟",
             callback_data="pishgiri_avarez_vaksan")],
            [InlineKeyboardButton("درمان عوارض واکسن",
             callback_data="darman_avareze_vaksan")]
            ]
reply_mark_1 = InlineKeyboardMarkup(keyboard_1)
reply_mark_2 = InlineKeyboardMarkup(keyboard_2)
reply_mark_3 = InlineKeyboardMarkup(keyboard_3)
reply_mark_4 = InlineKeyboardMarkup(keyboard_4)


def messagetoUs(update: Update, context: CallbackContext):
    print(update)
    # chat_id_admin = "202910393"
    chat_id_admin = "433711438"
    if update.effective_message.chat_id == int(chat_id_admin):
        chat_id_reply = update.message.reply_to_message.forward_from.id
        try:
            bot.forward_message(
                chat_id=chat_id_reply,
                from_chat_id=chat_id_admin,
                message_id=update.message.message_id
            )
            bot.send_message(
                chat_id=chat_id_admin,
                text=''' پیام شما با موفقیت به کاربر ارسال شد،
                ای سرباز امام زمان عجل الله تعای فرجه الشریف.'''
            )
        except Exception as e:
            pass
    if update.effective_message.chat_id != int(chat_id_admin):
        try:
            bot.forward_message(
                chat_id=chat_id_admin,
                from_chat_id=update.message.chat_id,
                message_id=update.message.message_id
            )
            bot.send_message(
                chat_id=update.message.chat_id,
                text='''
                این ربات حاوی آموزش رایگان مطالبی جهت پپیشگیری
                 و درمان کرونا براساس احادیث اسلامی تهیه شده است.
                ،مطالب ارائه شده به شرط نخوردن هرگونه دم کرده،بخور
                . معجون و ... تضمین می گردد .  
                 جهت کسب اطلاعات بیشتر می توانید از قسمت 
                ارتباط با ما
                در ارتباط باشید.
                    ''',
                reply_markup=reply_mark_1,
            )
        except Exception as e:
            print("error")


def query_btns(update: Update, context: CallbackContext):
    query: CallbackQuery = update.callback_query
    if query.data == "siroasal":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text="پیشگیری و درمان با حدیث پیامیر صل الله علیه وآله",
            reply_markup=reply_mark_2
            )
    elif query.data == "damnoosh":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''*چرا نباید دم کرده استفاده کنیم؟*
            *دمنوش ها کلا مضرر هستند؟*
            *خداوند بدن ما را طوری خلق کرده که قدرت انتخاب دارد
            و ازغذایی را که می خوریم بصورت طبیعی
            *هر چه را نیاز دارد استفاده و مابقی را دفع می نماید
            هر گاه سبزیجات و میوه ها را بصورت طبیعی مصرف می کنیم،
            بدن مازاد بر نیاز را دفع می نماید
            *کلیه ادویجات در غذا باعث تغییر طعم شده و در صورت استفاده مازاد
            با خراب کردن طعم غذا از خوردن آنها جلو گیری می شود
            و از برهم خوردن تعادل اخلاط بدن جلوگیری می شود*
            ولی وقتی بصورت جوشانده یا عریقات یا داروی شیمیایی مصرف می‌شود
            دیگر بدن قدرت جلوگیری از جذب مازاد را ندارد در نتیجه 
            باعث بهم خوردن تعادل بدن شده و باعث ایجاد بیماری جدید می شوند*
            *چرا ترکیب سیر خام یا داروی امام کاظم علیه السلام هیچ ضرری ندارد؟*
            *چون موادآن بصورت طبیعی مصرف می شوند وبدن قدرت دفع مازاد انرا دارد،
            ولی وقتی بصورت دم کرده یا عرقیات مصرف می شوند با جذب مازاد،
            باعث برهم خوردن تعادل بدن شده و خود عامل بیماری خواهند شد*
            *دم کرده ها دارو هستند فقط باید با مجوز طبیب
            برای مدت معین و به مقدار معین
            مصرف شوند در غیر اینصورت خود باعث بیماری می شوند*
            همانطور که امام علي عليه السلام می‌فرمایند:
            شُرْبُ الدَّواءِ لِلْجَسَدِ كَالصّابُونِ لِلثَّوْبِ ؛ يُنَقّيهِ وَ لكِنْ يُخْلِقُهُ.
            مصرف دارو براى بدن همچون صابون است نسبت به لباس 
            كه هر چند آن را پاک مى‌كند ولى فرسوده اش مى‌سازد.
            *دمنوش ها دارو هستند نه غذا، لذا نباید بصورت روزانه مصرف شود.
            و فقط فقط در زمان بیماری باید از دمنوش ها
            طبق توصیه طبیب برای فرد خاص
            به مقدار معین و زمان مشخص با روش درمانی خاص استفاده نمود.*
            *مردم بسیاری از گیاهان را کاملا اتفاقی و بدون آگاهی ترکیب می‌کنند
            که عوارض جبران ناپذیری از جمله فشار خون بالا بهمراه دارند
            لذا 
            نباید آویشن و زنجبیل و زعفران و دارچین و به لیمو و ...
            را بعنوان دمنوش روزانه انتخاب نمود
            *تریاک و مواد مخدر به هیچ وجه مصرف نکنید*
            ''',
            )
    elif query.data == "daruye_emam":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text="پیشگیری و درمان با حدیث امام کاظم علیه السلام",
            reply_markup=reply_mark_3
            )
    elif query.data == "vaksan":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text="جلوگیری از عوارض واکسن کرونا",
            reply_markup=reply_mark_4
            )
    elif query.data == "asnade_siroasal":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''دستور درمان با سیر توسط پیامبر صل الله علیه و آله
            *قَالَ رَسُولُ اللَّهِ ص كُلُوا الثُّومَ وَ تَدَاوَوْا بِهِ فَإِنَّ فِيهِ شِفَاءً مِنْ سَبْعِينَ دَاء.*
            *پیامبر اکرم صل الله علیه واله فرمود*
            *سیر بخورید و خود را با آن مداوا کنید که شفای هفتاد بیماری است.*
            موسوعة الأحاديث الطبية - محمد الريشهري - ج ٢ - الصفحة ٥٣٥    
            ''')
    elif query.data == "use_siroasal":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
            نیم کیلو سیر خام را رنده زده در ظرف شیشه ای قرار داده
            و نیم کیلو تا سه ربع کیلو  عسل معمولی اضافه کنید
            و برای ده تا پانزده دقیقه خوب هم بزنید تا عسل شل شود
            (در محیط عادی نگهداری شود تا یکسال قابل نگهداری است)
            کسانیکه با خوردن حالت تهوع می گیرند
            به ترکیب یک لیمو شیرازی با پوست بدون هسته چرخ کرده
            و ترکیب سیر خام و عسل اضافه کنید 
            رنگ ترکیب سیر خام عسل چند ساعت پس از
            تهیه تمایل به رنگ سبز پیدا می کند
            طعم آن بستر تند است و پس از گذشت یک ماه کاملا شیرین می شود
            ترکیب سیر خام و عسل 
            درمان تب و تمام بیماریهای ویروسی و عفونی و رماتیسم و... است لهذا
            همیشه یک کیلو ترکیب سیر خام و عسل در خانه نگهداری کنید
            تا در زمان نیاز طعم آن شیرین شده باشد
            ''',
            )
    elif query.data == "pishgiri_adi_siroasal":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
            برای پیشگیری کرونا
            روزانه یک حبه سیر را ریز ریز  کرده با یک لیوان آب قورت دهید
            (یا یک قاشق غذاخوری ترکیب سیر خام و عسل) نیم ساعت قبل از صبحانه 
            (حتما بعد از خوردن سیر خام صبحانه بخورید که معده درد نگیرید)*
            کسانیکه نمی توانند سیر تازه مصرف کنند
            پودر سیر را در کپسول 500 قرار داده،
            روزانه با یک لیوان آب نیم ساعت قبل از صبحانه میل کنند 
            به شرطی که پودر سیر را از شرکتهای غذایی معتبر تهیه کرده باشید
            کسانی که معده آنها اذیت می شود
            از ترکیب سیر و عسل معمولی هر روز یک قاشق چایخوری استفاده کنند
            به هیچ وجه دم کرده اصلا نخورید
            خانم های بار دار هم از این دستورالعمل استفاده کنند
            ،کسانی که افت فشار خون دارند 
            روزانه یک قاشق غذاخوری ترکیب سیر خام و عسل معمولی 
            را صبح نیم ساعت قبل از صبحانه میل کنند
            به هیچ وجه افراد سالم شب سیر خام یاترکیب سیرخام وعسل استفاده نکنند
            ''')
    elif query.data == "kadr_darman_siroasal":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
            هر روز صبح یک قاشق غذاخوری ترکیب سیر خام و عسل معمولی نیم ساعت قبل 
            از صبحانه میل کنید و بعد از خوردن ترکیب چند لقمه غذا 
            میل کنید که درد معده نگیرید
            .به شرطی که اصلا دم کرده نخورید،حتی نیاز به ماسک و .... ندارید،
            روزانه حداقل دو لیتر آب میل کنید
            افرادی که بیماری قند و کمی یا افزایش فشارخون دارند،نیز استفاده کنند
            روزانه یک قاشق غذاخوری سرکه طبیعی استفاده کنید
            ''')
    elif query.data == "darman_corona":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
            کسانی که مبتلا به کروناهستند
            هر شش ساعت یک قاشق غذاخوری ترکیب سیر خام و عسل بخورند
            و سپس یک لیوان آب میل کنید و بعد کمی غذا بخورید که معده درد نگیرید
            در کمتر ازهفت روز بدون نیاز به هیچ دارو ودرمان دیگری
            کاملا خوب می شوید 
            ( برای اطفال تا 5 سال قاشق چایخوری تا 9 سال قاشق مربا خوری)
            خانم های بار دار هم قاشق مرباخوری استفاده کنند
            اگر دچار حالت تهوع شدید چند قطره آب لیمو
            به آن اضافه کنید و بجای هر شش ساعت 
            ،هر ساعت یک قاشق چایخوری استفاده کنید تا معده شما عادت کند
            **
            کسانی که بستری و بیهوش هستند هر شش ساعت
            دو قاشق غذاخوری ترکیب سیر خام
            و عسل را در یک لیوان آب ولرم حل کرده و صاف کنید 
            و از لوله تغذیه وارد معده اش کنید
            ان شاءالله خداوند شفاء عنایت می کند
                        '''
             )
    elif query.data == "public_warning":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
            1=سیر خام و ترکیب سیر خام و عسل رقیق کننده خون هستند و
            از سایر داروهای رقیق کننده مثل آسپرین و.. استفاده نکنید
            2= حتما روزانه دو لیتر آب میل کنید
            3=کسانیکه داروی فشار یا قند یا چربی یا داروهای خاصی
             استفاده می کند همچنان داروهای خود را مصرف کنند
            4= به هیچ وجه هیچ دم کرده ایی (آویشن ، زنجبیل،دارچین،....) نخورید
            5= *غذا آدم کرونایی سوپ ساده و غذای فرد سرما خورده است ،
             از خوردن غذا های دیر هضم جدا بپرهیزید ( جگر و ...)*
            6= مواد مخدر هیچ اثر مثبتی
             در پیشگیری و درمان نداشته و باعث کاهش ایمنی بدن می گردد
            7= برای پیشگیری هرگز سیر خام
             یا ترکیب سیر و عسل را در شب و با شکم خالی مصرف نکنید
                        ''')
    elif query.data == "darman_sayere_bimariha_siroasal":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
            کلیه عفونت ها
            1=ریشه مو ، 2=مغز ، 3=سینوزیت ، 4=گلو،
            5=دندان درد 7= لثه، 8=گوش ، 9=معده ،10= روده ، 11= بیماریهای کبدی ،
            12= بیماریهای خونی ، 13= بیماریهای سیستم تناسلی و مقاربتی
            14= ناتوانایی های جنسی ناشی از بیماری دستگاه تناسلی ،
            15=روماتیسم قلب و مفاصل ،16= بیماریهای کلیه و مجاری ادرای ،
            17= دفع سنگ کلیه ،
            18= بیماریهای رحم و کیست ،19= انواع سرطان ها
            20= بیماریهای قلبی و گرفتگی عروق
            روش درمان
            1=هیچ دم کرده و بخوری یا معجون استفاده نکنید
            2= برای پیشگیری از امراض فوق و بسیاری از بیماریهای دیگر
            یک هفته روزانه یک حبه سیر خام را ریز ریز کرده انتهای گلو قرار دهید
            و با یک لیوان آب نیم ساعت قبل از صبحانه میل کنید
            در هفته دوم یک روز در میان و در هفته سوم و هفته های بعد
            هر سه روز یکبار خوردن یک حبه سیر خام را انجام دهید
            3= برای درمان بر اساس نوع و شدت بیماری بین سه روز تا یکماه
            هر روز هر شش ساعت یک قاشق غذاخوری
            ترکیب سیر خام و عسل معمولی استفاده کنید و سپس تا چهار ماه
            هر روز صبح یک قاشق غذاخوری ترکیب سیر خام و عسل
            را با یک لیوان آب نیم ساعت قبل از صبحانه میل کنید
            4= آویشن را آسیاب کرده به نسبت سه
            قاشق آویشن و یک قاشق نمک طبیعی آسیاب شده
            مخلوط کرده در نمکدان سفره قرار داده
            و ربع قاشق چایخوری قبل از هر غذا بخورید
            5= روزانه بعد از غذا دو قاشق غذاخوری سرکه طبیعی را
             در یک لیوان آب ریخته میل کنید
            6= مواد مخدر استعمال نکنید
            7= روزانه دست راست خود را در موضع بیماری قرار داده
             و هفت بار سوره مبارکه حمد را قرائت فرمائید
            8=برای درمان سینوزیت قبل وضو سه باراستنشاق کنید 
            ( میشود نه بار در روز با فاصله زمانی تقریبا هر هشت ساعت سه بار)
                        '''
        )                
    elif query.data == "asnade_daru":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
        حدیث و مستندات
        قَالَ السَّرِیُّ بْنُ أَحْمَدَ بْنِ السَّرِیِّ قَالَ:
        حَدَّثَنِی مُحَمَّدُ بْنُ یَحْیَى الْأَرْمَنِیُّ قَالَ:
        حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ عَنِ الرِّضَا ع قَالَ‏:
        سَمِعْتُ مُوسَى بْنَ جَعْفَرٍ ع
        وَ قَدِ اشْتَکَى فَجَاءَهُ الْمُتَرَفِّعُونَ بِالْأَدْوِیَةِ یَعْنِی 
        الْأَطِبَّاءَ فَجَعَلُوا یَصِفُونَ
        لَهُ الْعَجَائِبَ فَقَالَ أَیْنَ یَذْهَبُ بِکُمْ اقْتَصِرُوا 
        عَلَى سَیِّدِ هَذِهِ الْأَدْوِیَةِ
        الْإِهْلِیلَجِ وَ الرَّازِیَانَجِ وَ السُّکَّرِ
        فِی اسْتِقْبَالِ الصَّیْفِ ثَلَاثَةَ 
        أَشْهُرٍ فِی کُلِّ شَهْرِ ثَلَاثَ مَرَّاتٍ وَ
        فِی اسْتِقْبَالِ الشِّتَاءِ ثَلَاثَةَ
        أَشْهُرٍ کُلَّ شَهْرٍ ثَلَاثَةَ أَیَّامٍ ثَلَاثَ مَرَّاتٍ وَ یُجْعَلُ
        مَوْضِعَ الرَّازِیَانَجِ مَصْطَکَى فَلَا یَمْرَضُ‏ إِلَّا مَرَضَ‏ الْمَوْت‏
        از امام رضا علیه السلام نقل شده که فرمود:
        امام کاظم (ع) بیمار شدند و پزشکان نزد ایشان آمده
        و برایشان نسخه‌های عجیب نوشتند.حضرت فرمودند:
        چه برشما آمده است؟ به سید و آقای این داروها اکتفا کنید.
        هلیله و رازیانه وشکر در سه ماه اول تابستان،
        در هر ماه سه مرتبه و در سه ماه اول زمستان،
        در هر ماه سه روز و به جای رازیانه،مصطکی(در زمستان) قرار داده می‌شود.
        پس بیمار نمی‌شود مگر به بیماری مرگ.
        طب الأئمة علیهم السلام، ص50
        بحار الأنوار،ج‏59،ص99
        مستدرک الوسائل و مستنبط المسائل،ج‏16،ص442
        حدیث داروی امام کاظم علیه السلام را *بزرگان محدثین شیعه*
        چون نویسنده کتاب وسائل الشیعه *علامه حر العاملی*
        ( شیخ حر عاملی معقتد است که نمی‌توان به ظن عمل نمود
        چون امکان دست‌یابی به علم در مورد احکام شرعی وجود دارد)
        درکتاب : الفصول المهمة في أصول الأئمة صفحه 55 و 
        *میرزای نوری* در کتاب : مستدرك الوسائل جلد : ١٦ صفحه 442
        و *شهید اول  نویسنده  کتاب درسی حوزه های علمیه کتاب لمعه،
        درکتاب الدروس باب ملتقط من طب الائمه*
        این حدیث را تدریس کرده و *معتبر دانسته و آن را نقل کرده اند*
        و *علامه مجلسی* نیز در کتاب بحار الانوار انرا جزء 
        *احادیث مشهور شیعه* دانسته و نقل کرده است*
        *ایت الله محمد حسین عقیلی علوی خراسانی،
        پزشک نامدار سدهٔ دوازدهم هجری است.
        وی در شیرازروزگار گذرانیده و چندی نیز در هند به سر برد.
        دو تألیف بسیار مهم از این پزشک در دست است
        که یکی مخزن الادویه در داروهای ساده و غیرترکیبی است.
        تألیف دیگر مجمع الجوامع و ذخایر التراکیب است
        که به قرابادین کبیرشهرت یافته و شامل داروهای ترکیبی است
        در *کتاب مخزن الاویه صفحه 187داروی امام کاظم را بیان کرده است*
        اگر برای چند طلبه سند ثابت نشده مهم نیست چرا که
        برای بزرگان علم و نویسندگان کتب حدیث این حدیث ثابت شده بوده است
        ''')
    elif query.data == "tabestane":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''از
        عطاری داروی آماده نخرید
        اکثرا نظر شخصی عطار است نه امام علیه السلام ،   
        روش تهیه داروی امام کاظم علیه السلام جهت ماههای گرم (تابستانه)  
        ،با مراجعه به عطاری 50 گرم هلیله سیاه، 50 گرم رازیانه،
        و50 گرم شکر قرمز تهیه کنید 
        حداکثر 25 هزار تومان (اگر شکر قرمز پیدا نکردید از شکر قهوه ای
        ودر صورت نبود از نبات استفاده کنید)
        هلیه سیاه را اول با هاونگ خورد و سپس آسیاب کنید
        حالا رازیانه را هم آسیاب کنید
        شکر سرخ که خریدید بصورت خمیر است انرا تیکه تیکه کرده
        با پودر حاصل از رازیانه
        و هلیله مخلوط کنید و بمالید تا پودر شود
        یا در ماکروفر حرارت دهید تا نرم شود اگر هم شکر قرمز که خریدید
        خشک است آن را با هاون خورد و 
        اسیاب کنید و با پودر هلیله و رازیانه ترکیب کنید
        شما الان 150 گرم داروی امام کاظم علیه السلام ( برای مصرف تابستانه)
         دارید که برای جلوگیری 
        از بیمار شدن  15 نفر به کرونا در یکماه یا مداوای 3 نفر کافی است
         ترکیب داروی امام کاظم علیه السلام  بر اساس حدیث 
        .از معصوم علیه السلام است
        و نباید به ان چیزی اضافه یا کم کرد 
                    ''')
    elif query.data == "zemestane":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
            از عطاری داروی اماده نخرید
             اکثرا نظر شخصی عطار است نه امام علیه السلام ،   
            روش تهیه داروی امام کاظم علیه السلام برای ماههای سرد (زمستانه)
            50 گرم هلیله را اسیاب کرده با 50 گرم مصطکی اسیاب کرده
             (برای راحت اسیاب کردن مصطکی انرا
             در فریزر قرار داده تا کاملا سرد و شکننده شود
             سپس برای مدت چند ثانیه اسیاب کنید)
             را با 50 گرم شکر قرمز مخلوط کنید
             شما الان 150 گرم داروی امام کاظم علیه السلام
             ( برای مصرف زمستانه) دارید
            که برای جلوگیری از بیمار شدن  15 نفر به کرونا 
            در یکماه یا مداوای 3 نفر کافی است
            (با شروع فصل سرما از مصطکی بجای رازیانه استفاده کنید
             از مصطکی و رازیانه با هم استفاده نکنید)
            ترکیب داروی امام کاظم علیه السلام  بر اساس حدیث 
            از معصوم علیه السلام است
             و نباید به ان چیزی اضافه یا کم کرد                         
            ''')
    elif query.data == "mavarede_khas_daru":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
        کسانیکه کرونا یا آنفولانزا یا سرما خوردگی یا آسم دارند داروی امام کاظم علیه السلام را بصورت پودر برای مدت پنج روز و هر هشت ساعت یک قاشق چایخوری مصرف کنند به تمام افراد خانواده هم که با بیمار در تماس هستند و سالم هستند هر ده روز یک قاشق چایخوری بدهند
        افراد زیر دو سال ربع قاشق چایخوری  
        بصورت کم کم، افراد دو تا هفت سال نصف قاشق 
        چایخوری و افراد بالای هفت سال یک قاشق چایخوری مصرف کنند
        افراد سالم و کسانیکه بیمار شده و بهبود یافته اند
         برای پیشگیری هر ده روز یک قاشق چایخوری بخورند
        «یکساعت قبل و بعد از مصرف دارو هیچ چیز حتی اب مصرف نشود،»
        : فقط کسانیکه پیوند عضو داده اند استفاده نکنند
        بانوان باردار در مصرف دارو زیاده روی نکنند
         و حتما یکساعت بعد از مصرف دارو
         دو لیوان اب و پنج دانه خرما بخورند
        تحت هیچ شرایط
         همزمان از داروهای شیمیایی و گیاهی دیگر یا دمنوش ها یا بخور با
         مصرف داروی امام کاظم علیه السلام استفاده نکنید
        ضمنا دیفن هیدرامین ،مسکن ها
         وداروهای دارای ترکیبات کورتون باعث تضعیف سیستم ایمنی بدن شده
         و عملا اثر داروی امام کاظم علیه السلام را کاهش می دهند
         مصرف همزمان با ازیترومایسین باعث مشکلات معده میگردد
        تحت هیچ شرایط مصرف یک قاشق چایخوری داروی امام کاظم علیه السلام را هر ده
         روز یکبار تا پایان دوره همه گیری بیماری ترک نکنید
        اگر بدلیل تلخی دارو اذیت میشوید
         یک قاشق را در چند نوبت بخورید ، یا دارو را کف دستتان 
        ریخته و به ان *فقط شکر اضافه کرده با نوک زبان بخورید* 
        کسانیکه برای اولین بار دارو را مصرف می کنند یا با تاخیر از دارو استفاده می کنند اگر دچار بیماری پنهان باشند با افزایش سیستم ایمنی و تشخیص توسط بدن دچار تب و سرفه میشوند در این حالت باید برای حداقل هر هشت ساعت یک قاشق چایخوری داروی استفاده کنند
        افرادی که دارای بیماری قند یا فشار خون هستند می توانند
         از داروی امام کاظم علیه السلام استفاده کنند''')
    elif query.data == "khozestan":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
            ما در خوزستان 120،000 بسته رایگان داروی امام کاظم علیه السلام 
            را توزیع کردیم از حدود 480،000 نفر که برای پیشگیری
             و درمان سرما خوردگی ، آنفولانزا و کرونا
             و اسم  از داروی امام کاظم علیه السلام
             استفاده کرده اند 8 نفر که دستورالعمل مصرف
             را رعایت نکرده بودند گزارش ابتلا به کرونای خفیف دادند
            داروی امام کاظم علیه السلام سیستم ایمنی بدن
            را بشدت بالا برده وبا شناسایی سریع عامل بیماری و نابودی ان ،
            از ایجاد بیماریها در بدن جلوگیری کرده
             و بیماریها را نیز درمان می کند''')
    elif query.data == "vaksan_nemizanim":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
        همه واکسن ها دارای عوارض ناشناخته هستند
        و مراحل تحقیقات آنها نا تمام است
        انسان عاقل کار بدون هدف نمی کند
        هدف از استفاده از واکسن جلو گیری 
        از بیماری یا کاهش اثرات بیماری است در ساخت واکسن ها تحقیقات
        بر روی ویروس موجود انجام می شود با توجه به جهش مداوم ویروس کرونا
        عملا واکسن های ساخته شده کارایی خود را از دست می دهد به افزایش آمار
        در کشورهایی که درصد بالایی از جمعیت را واکسینه کرده و هم اکنون
        در اثر ویروس جهش یافته مجددا مجبور
        به تکرار محدودیت ها شده اند توجه فرمائید
        یعنی شما چه واکسن بزنید و چه نزنید
        پروتکل‌هایی که باید رعایت کنید تغییر نمی کند
        وقتی از شروع کرونا با رعایت احادیث پیامبر و امام کاظم علیهما السلام بدون
         هیچگونه آسیب ناشی از کرونا بدون ماسک و الکل و... تا کنون 
        88 کرونایی بغل کرده و از باقیمانده اب لیوان آنها آشامیده ام و خود و
        بستگانم دچار هیچ مشکلی نشده ایم چرا باید واکسن زده
        و مانند هزار نفر خود و بستگانم را بیمار کنم؟''')
    elif query.data == "vaksan_maraje":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text=''' 
        چون مسئله شرعی است تقیه نمی کنم
        به جز عمل پیامبر و امامان معصوم و حضرت فاطمه علیهم السلام
        عمل هیچ کس حتی نواب خاص امام معصوم حجیت ندارد
        اگر فرد احتمال عقلی بر ضرر استفاده از واکسن را بدهد
        زدن واکسن مطابق حکم 
        عقل و فتوای همه مراجع تقلید حرام خواهد بود
        علت زدن واکسن توسط رهبری و مراجع عدم تخصص آنها در استفاده تجربی
        از احادیث طبی و بناچار مراجعه به متخصص طب است
        و چون مشاوران آنها فقط از افراد پزشکان
        طب نوین هستند لهذا به دستورات آنها عمل می کنند
        تشخیص هر حکم شرعی در مرحله اول با خود فرد است 
        و در مرحله دوم عمل به احتیاط است و در مرحله سوم اگر
         دو مرحله قبل برایش میسر نشد مراجعه به فقیه اعلم است
        و هرگاه یقین کند که حتی مجتهد اعلم در مسئله ایی فتوی
        اشتباه داده است شرعا عمل به فتوی او برایش جایز نیست 
        چون تشخیص حکم شرعی در مرحله اول با خود مکلف است
        *لطفا قبل ارسال هر پاسخی اول از مرجع تقلید خود استفتا کنید*
         تقیه را در این مورد که باعث کشته شدن بالای صد هزار نفر
         و هدر رفت میلیارد ها تومان در کشور شده را بر خود جایز نمی دانم
         ''')
    elif query.data == "avareze_vaksan":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
        1=بعضی از افراد *با زدن واکسن کرونا دچار کرونا
        با شدت کم یا زیاد* می شوند امروز تمامی علائم ایجاد شده پس از زدن واکسن
        را با توجه به ناشناخته بودن علائم همه را به کرونا نسبت می دهند
        2= بعضی از افراد *با زدن واکسن کرونا
         دچار لخته شدن خون در بدن و عوارض بعدی
         آن از جمله سکته های قلبی بدون داشتن هیچ علامت قبلی می شوند*
        3= با توجه به عدم تکمیل چرخه تحقیقات همه واکسن های کرونا در دنیا 
        دارای مجوز مصرف اضطراری هستند و
        بسیاری از عوارض آن در آینده مشخص خواهد شد
        ''')   
    elif query.data == "pishgiri_avarez_vaksan":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
            *1= از دو روز  قبل از زدن واکسن حتما روزانه 
            هر هشت ساعت یک قاشق غذا خوری ترکیب سیر خام و عسل میل کنید 
            2= پس از زدن واکسن تا یک هفته حتما 
            هر شش ساعت یک قاشق غذا خوری ترکیب سیر خام و عسل میل کنید*
            3= روزانه حداقل دو لیتر آب میل کنید
            4= به هیچ وجه دم کرده اصلا نخورید باعث کاهش ایمنی بدن می گردد
            حتی کسانی که بیماری دیابت یا
            بیماریهای زمینه ای دارند نیز این دستورالعمل را انجام دهند '''
                        )
    elif query.data == "darman_avareze_vaksan":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''
            اگر دچار علائم کرونا شده اید یا
            حتی اگر هیچ عارضه ای ندارید چون
            احتمال ایجاد لخته خون و سکته ناگهانی بدون هیچ علامت قبلی و جود دارد
            1=حتما یک هفته هر شش ساعت
            یک قاشق غذاخوری ترکیب سیر خام و عسل معمولی میل کنید 
            2= روزانه حداقل دو لیتر آب میل کنید
            3= بهیچوجه دم کرده اصلا نخورید باعث کاهش ایمنی بدن می گردد
            4=فقط غذای سبک مانند غذای فرد سرماخورده استفاده کنید
            ( از خوردن غذای سنگین
             مثل کباب ، گوشت سرخ کرده ، جگر ...جددا خودداری کنید)
            5= به هیچ وجه از مواد مخدر استفاده نکنید
            حتی کسانی که بیماری دیابت یا بیماریهای زمینه ای
            دارند نیز این دستورالعمل را انجام دهند
              '''
                        )            
    elif query.data == "contact_us":
        bot.send_message(
            chat_id=update.effective_message.chat_id,
            text='''شماره تماس این جانب(سید محمد علی شیخ الاسلامی): 09161187872
            +\n
            '@Ma_Sheikholeslami ارتباط در تلگرام'
                '''
            )
    # elif query.data == "":
    #     bot.send_message(
    #         chat_id=update.effective_message.chat_id,
    #         text='''''')
    # elif query.data == "experiment_siroasal":
    #     bot.send_message(
    #         chat_id=update.effective_message.chat_id,
    #         text='''


dispatcher.add_handler(MessageHandler(
    Filters.text, messagetoUs))
dispatcher.add_handler(CallbackQueryHandler(query_btns))
updater.start_polling()
